<a href="https://colab.research.google.com/github/shubham-20120/ML-Algorithms-Implementations/blob/main/Titanic%20survival%20predictions%20using%20Decision%20tree%20(kaggle%20Competition).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [70]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
import math
import matplotlib.pyplot as plt
import seaborn as sns

In [71]:
trainData = pd.read_csv('/content/train.csv')
testDataTemp = pd.read_csv('/content/test.csv')

In [72]:
trainData = trainData.drop(trainData.columns[[0, 3, 8, 9, 10]], 1)
testData = testDataTemp.drop(testDataTemp.columns[[0, 2, 7, 8, 9]], 1)

In [73]:
xtrain = trainData.iloc[:, 1:]
ytrain = trainData.iloc[:, 0]
xtest = testData

In [74]:
sexEncoder = LabelEncoder()
embEncoder = LabelEncoder()
xtrain['Embarked'].fillna('S')
xtest['Embarked'].fillna('S')
xtrain['Sex'] = sexEncoder.fit_transform(xtrain['Sex'])
xtest['Sex'] = sexEncoder.fit_transform(xtest['Sex'])
for i in range(len(xtrain['Embarked'])):
    if str(xtrain['Embarked'][i])=='nan':
        xtrain['Embarked'][i] = str('S')
for i in range(len(xtest['Embarked'])):
    if str(xtest['Embarked'][i])=='nan':
        xtest['Embarked'][i] = str('S')
xtrain['Embarked'] = embEncoder.fit_transform(xtrain['Embarked'])
xtest['Embarked'] = embEncoder.fit_transform(xtest['Embarked'])
xtrain = xtrain.interpolate()
xtest = xtest.interpolate()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

In [75]:
xtrain.head()

   Pclass  Sex   Age  SibSp  Parch  Embarked
0       3    1  22.0      1      0         2
1       1    0  38.0      1      0         0
2       3    0  26.0      0      0         2
3       1    0  35.0      1      0         2
4       3    1  35.0      0      0         2

In [76]:
xtest.head()

   Pclass  Sex   Age  SibSp  Parch  Embarked
0       3    1  34.5      0      0         1
1       3    0  47.0      1      0         2
2       2    1  62.0      0      0         1
3       3    1  27.0      0      0         2
4       3    0  22.0      1      1         2

In [77]:
xtrain.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Embarked    0
dtype: int64

In [78]:
from sklearn.tree import DecisionTreeClassifier
tree = DecisionTreeClassifier()

In [79]:
tree = tree.fit(xtrain, ytrain)

In [80]:
ytest = tree.predict(xtest)

In [81]:
testDataTemp.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [82]:
testDataTemp['PassengerId'].head()

0    892
1    893
2    894
3    895
4    896
Name: PassengerId, dtype: int64

In [83]:
output['PassengerId'] = testDataTemp['PassengerId'].values
output['Survived'] = pd.DataFrame(ytest).values

In [84]:
output.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         1
3          895         1
4          896         1

In [85]:
output.to_csv('output.csv')

In [86]:
output

     PassengerId  Survived
0            892         0
1            893         0
2            894         1
3            895         1
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]